ArtMoney Plugin
8.17
Μεταφρασμένο στην Ελληνική από τον// Μηλιατζίδη Γεώργιο
Μηλιατζίδη Γεώργιο
nurglath_notspam_yahoo.com
Περί
Cheater παιχνιδιού
<ms> <d>, <yyyy>//μορφή ημερομηνίας
Πνευματικά δικαιώματα(Copyright) (C) 1996-2020, System SoftLab
Εάν βρήκατε σφάλματα ή
έχετε κάποιες προτάσεις, στείλτε τα στην εταιρεία
Παρακαλώ επισκεφθείτε τον ιστοχώρο του ΑrtΜoney για την τελευταία έκδοσή του
Τιμή
Εύρεση
Περαιτέρω εύρεση
Αριθμός των τιμών
Κατ' αρχάς επιλέξτε το προς επεξεργασίαν παιχνίδι
Τώρα ξεκινήστε την εύρεση στο επιλεγμένο προς επεξεργασίαν παιχνίδι
Κάντε περαιτέρω εύρεση στους αριθμούς που βρέθηκαν μέχρις ότου παύσουν να ελαττώνονται
Συγνώμη, αλλά δεν βρήκατε τίποτα. Ξαναπροσπαθήστε
Ανενεργό
Βρέθηκαν
αριθμοί
αριθμοί
αριθμός
Στον πίνακα
Σφάλμα ανοίγματος
Σφάλμα εύρεσης
Σφάλμα περαιτέρω εύρεσης
Ο τύπος του αρχείου δεν υποστηρίζεται
Αδύνατος αριθμός για τον τύπο που επιλέξατε
Δεν μπορώ να φορτώσω το αρχείο
Επεξεργασία εύρεσης
Επεξεργασία περαιτέρω εύρεσης
Όλοι οι πιθανοί
byte(δυφιοσυλλαβή)
byte(δυφιοσυλλαβή)
bytes(δυφιοσυλλαβές)
Εσφαλμένη μέθοδος. Δοκιμάστε μερικές άλλες.
δευτερόλεπτα
λεπτά
Δεν επιλέξατε τύπο για αυτήν την μέθοδο
Το μέγεθος του τύπου δεν μπορεί να είναι μεγαλύτερο από
έχει αλλάξει
δεν έχει αλλάξει
αυξήθηκε
ελαττώθηκε
Αυτός ο πίνακας δημιουργήθηκε από μία νεώτερη έκδοση
Αυτός ο πίνακας είναι κατεστραμμένος
Σφάλμα πρόσβασης στο αρχείο
Ακέραιος 1 byte(δυφιοσυλλαβή)
Ακέραιος 2 bytes
Ακέραιος 3 bytes
Ακέραιος 4 bytes
Ακέραιος 8 bytes
Επιπλέων 4 bytes
Επιπλέων 6 bytes
Επιπλέων 8 bytes
Επιπλέων 10 bytes
Κείμενο
Μηδενικά τερματισμένη ακολουθία
Μηδενική ακολουθία
Ακολουθία Πασκάλ
Αν.Ακέραιος 2 bytes(δυφιοσυλλαβές)//Αν.=Αντίστροφος
Αν.Ακέραιος 3 bytes
Αν.Ακέραιος 4 bytes
Αν.Ακέραιος 8 bytes
Αν.Επιπλέον 4 bytes
Αν.Επιπλέον 6 bytes
Αν.Επιπλέον 8 bytes
Αν.Επιπλέον 10 bytes
Αν.Κείμενο
Αν.Μηδενική Ακολουθία
Αν.Ακολουθία Πασκάλ
Ιανουάριος
Φεβρουάριος
Μάρτιος
Απρίλιος
Μάιος
Ιούνιος
Ιούλιος
Αύγουστος
Σεπτέμβριος
Οκτώβριος
Νοέμβριος
Δεκέμβριος
F//F=Πάγωσε
Βοήθεια
Περί
Επιλέξτε διεργασία.
Απαλοιφή
Άνοιγμα
Αποθήκευση
Προσάρτηση
Προσάρτηση όλων
Επεξεργασία
Αντιγραφή
Διαγραφή
Πάγωμα
Ξεπάγωμα
Εφαρμογή αυτόματης απόκλισης
Πληροφορίες
Τύπος παιχνιδιού
Χρόνος Παγώματος(σε ms - χιλιοστά του δευτερολέπτου)
Χρόνος Ανανέωσης(σε ms)
Γλώσσα
Εμφάνιση διευθύνσεων
Πλήκτρο συντ. Ανάδυσης
Γενικές
Περαιτέρω
Προσωπικές
Ηλ. Ταχυδρομείο
Προκαθορισμένο σχόλιο
Λειτουργικό Σύστημα
Μορφή δεκαδικών
Σειρά των Bytes
Προτεραιότητα εύρεσης
Υψηλή
Πλήρης
Επιλογές
Άκυρο
Κανονική
Επεξεργασία διεύθυνσης
Πάγωμα
Μέγεθος
Διεύθυνση
Περιγραφή
Τύπος
Αντιστραμμένη
Ακριβής τιμή
Ακολουθία τιμών
Περιοχή τιμών
Άγνωστη τιμή
Κωδικοποιημένη τιμή
Τροποποιημένη
Επιλέξτε τύπο
Σειρά Bytes
Κανονικά και αντιστραμμένα
ΌΛΑ
Ακέραιος
Επιπλέων
Χρόνος από την αρχή:
Εναπομένων χρόνος:
Ταχύτητα:
Βρέθηκαν:
Παιχνίδι
Σχόλιο
Ημερομηνία
Σύστημα
Πληροφορίες πίνακα
Δημιουργήθηκε από
Όνομα
Τοποθεσία
Εισαγωγή ακολουθίας
Ρύθμιση πλήκτρου συντόμευσης
Αντιστραμμένη
Εύρεση σε αυτό το κομμάτι μνήμης
Εύρεση εντός των περιθωρίων της μνήμης
Εξοικονόμηση χώρου στον σκληρό δίσκο
από
εώς
Εύρεση
φίλτρο
Βήμα
Βήμα//ορισμός τιμής
ορίσμος τιμής ως
επιλογή όλων
ΑΥΤΟΜΑΤΗ ΕΥΡΕΣΗ
Εμφάνιση διεργασιών
ορατές
με παράθυρα
Πληροφορίες διεργασίας
Εξαναγκασμός σε τερματισμό διεργασίας
Εμφάνιση παραθύρου
Απόκρυψη παραθύρου
Είστε σίγουρος οτι θέλετε να τερματίσετε την διεργασία;
Αδύνατη η πρόσβαση
Αδύνατος ο τερματισμός της διεργασίας
Όνομα αρχείου
Τύπος επεξεργασίας
Μέγεθος δεδομένων
Υπολογ. ταχύτητας
Υπολογισμός για τη μέτρηση της ταχύτητας ανίχνευσης στη μνήμη
Περιμένετε
Το σύστημά σας
Ειδικά πλήκτρα συντόμευσης
Προσθήκη στην τιμή
Κλείδωσε αυτό το παράθυρο
Ενεργ. αναίρεσης/Επανάληψης του φιλτραρίσματος
Προβολή ακεραίων
Χωρίς πρόσημο
Με πρόσημο
Αναίρεση του φιλτραρίσματος
Επανάληψη του φιλτραρίσματος
Αποθήκευση του φιλτραρίσματος
Άνοιγμα του φιλτραρίσματος
Το τρέχον βήμα είναι
Η "Αναίρεση του φιλτραρίσματος" Δεν είναι ενεργή
Η "Επανάληψη του φιλτραρίσματος" Δεν είναι ενεργή
Το "Άνοιγμα του φιλτραρίσματος" Δεν είναι ενεργό
αυξήθηκε κατά
ελαττώθηκε κατά
Περιβάλλον
Πλήκτρα συντόμευσης
Τα πλήκτρα συντόμευσης είναι ενεργά
Προκαθορισμένα πλήκτρα συντόμευσης
Κύρια γραμματοσειρά
Γραμματοσειρά πίνακα
Χρώμα κυρίως παρασκηνίου
Χρώμα παρασκηνίου εισαγωγών
Χρώμα πλήκτρων
Ελλειψοειδή πλήκτρα
Εντάξει
Διορθωτής(editor) μνήμης
Δεκαεξαδική εμφάνιση
Δεκαεξαδικός διορθωτής
Αριθμός των στηλών τιμών
Εμφάνιση κελιών
Τρέχων κελί
Μετακίνηση
Μετακίνηση στα αποτελέσματα εύρεσης
Μετακίνηση στον πίνακα
Μετακίνηση στο κομμάτι μνήμης
Μετακίνηση στην διεύθυνση
Πρώτος
Προηγούμενος
Επόμενος
Τελευταίος
Συνολικό
Τρέχων
Αντίγραψε την περιοχή
Παρέμβαλε την περιοχή
Πρόσθεσε στον πίνακα
ΌΛΑ (standard)
Ακέραιος (standard)
Πλωτός (standard)
Αναστροφή επιλογής
Στοίχιση στηλών
<ΟΧΙ>
Δείκτης
Ανανέωση
Ρύθμιση επιλεγμένων
Σύνολο
Ορατό σύνολο
Επιλογή συνόλου
Αποθήκευση αυτής της διεύθυνσης/δείκτη
Αυτόματη απόκλιση της απόκλισης σε όλα
Αυτόματη απόκλιση της απόκλισης στο σύνολο
Αυτόματη απόκλιση της απόκλισης αποθήκευσης διευθύνσεων σε όλα
Αυτόματη απόκλιση της απόκλισης αποθήκευσης διευθύνσεων στο σύνολο
Οι εντολές με δείκτες
Ορισμός του δείκτη σε όλα
Ορισμός του δείκτη στο σύνολο
Ορισμός δείκτη αποθήκευσης σε όλα
Ορισμός δείκτη αποθήκευσης στο σύνολο
Ορισμός δεικτών σε αυτήν την διεύθυνση
Ορισμός δεικτών στην διεύθυνση αποθήκευσης
Ανίχνευση του δείκτη σε αυτήν την διεύθυνση
Ανίχνευση του δείκτη στην αρχή του κομματιού μνήμης
Ταξιμόμηση
Ταξινόμηση κατά περιγραφή
Ταξινόμηση κατά διεύθυνση
Ταξινόμηση κατά τιμή
Ταξινόμηση κατά τιμή ως κείμενο
Ταξινόμηση κατά σύνολο
Προσάρτηση
Σφάλμα προσάρτησης
Και οι δύο πίνακες πρέπει να να έχουν δημιουργηθεί από έναν(τον ίδιο) εκδότη
Επιλογή τρέχουσας διεργασίας
Σύνολο χαρακτήρων
Εμφάνιση ορατού πίνακα συνόλου
στο σύνολο
Μετατροπή δεικτών σε διευθύνσεις
Ορισμός φίλτρου
Ακολουθία
<Το αρχείο δεν βρέθηκε>
<Απαγορεύεται η πρόσβαση>
Διορθωτής αρχείου
Σφάλματα
<Το μέγεθος άλλαξε>
Θέμα
Δεν υπάρχει θέμα
Επεξεργασία γραμματοσειράς
Χρώμα πίνακα
Αποθήκευση μίας στίβας μνήμης
Κατά φόρμουλα(formula)
Διεργασία
Διακοπή διεργασίας
Συνέχιση διεργασίας
Αποθήκευση διεργασίας
Φόρτωση διεργασίας
Αναγνωριστικό διεργασίας
Προτεραιότητα
Αρχείο(-α)
Πληροφορίες αρχείου(-ων)
Επιλογή Αρχείου
Επιλογή Φακέλων
Αριθμός αρχείου(-ων)
Συνολικό μέγεθος
Μετακίνηση στον φάκελο
Αντικείμενο
Πίνακας
Έξοδος
Αποτέλεσμα
Περισσότερα
Αγοράστε το "ArtMoney Pro" μέσω διαδικτύου
Επισκεφθείτε τον ιστότοπο
Εγχειρίδιο χρήσης του ArtMoney
Κωδικοποίηση
Επιλογή κωδικοποίησης
Φωτεινότητα
Απόχρωση
Εμφάνιση κεντρικού μενού
Χρήση μη επισήμων προσθέτων γλώσσας
Διακοπή διεργασίας κατά την αναζήτηση
Αποθήκευση/Φόρτωση τιμών στο αρχείο-πίνακα
Βιβλιοθήκη για αναγνώστη διεργασίας
Επιλογές φακέλων
Μάσκα ονόματος αρχείου
Ώρα τροποποίησης
Ημερομηνία αρχείου
Ώρα αρχείου
Μή έλεγχος
Τελευταίων 15 λεπτών
Τελευτάιας ώρας
Τελευταίας ημέρας
Τελευταίου μήνα
Τελευταίου έτους
Περισσότερο από
Λιγότερο από
Αυτή η δυνατότητα είναι διαθέσιμη μόνον στην έκδοση ArtMoney Pro
Μόνον στην έκδοση ArtMoney Pro
Συμφωνητικό αδείας
Συμφωνώ με τους όρους και τις συνθήκες του Συμφωνητικού Αδείας
Περί της εκδόσεως Pro
Ιδιαίτερες ευχαριστίες
για την σχεδίαση του εγχειριδίου χρήσης
για το λογότυπο
για το πρόγραμμα εγκατάστασης
για την δημιουγία του εικονιδίου
για τον γραμματικό έλεγχο του Αγγλικού εγχειριδίου χρήσης
για την βοήθεια
για το πακέτο της μηχανής θεμάτων(package ThemeEngine)
για τις συμβουλές και τα πολύτιμα σχόλια
για την μετάφραση
για τους πίνακες
Αριθμός Καταχώρησης
Μη καταχωρημένο
Να μην ξαναερωτηθώ για το συνθηματικό μου
Μόνον για τον τρέχοντα χρήστη
Διακοπή της διεργασίας και εμφάνιση αναδυόμενου παραθύρου
Μεταγωγή και συνέχιση της διεργασίας
Υπερθετική αγκίλη κλεισίματος
Απαραίτητη αγκίλη κλεισίματος
Υπερθετικά ερωτηματικά κλεισίματος
Εσφαλμένο αναγνωριστικό
Εσφαλμένοι αριθμοί προτάσεων(arguments) (M1,M2...)
Εσφαλμένοι αριθμοί λειτουργιών(-,+)
Εσφαλμένοι αριθμοί συνθηκών(<,>,=)
Εσφαλμένος αριθμός εκφράσεων
Εσφαλμένη έκφραση
Αυτό το βήμα δεν υφίσταται
Εσφαλμένη συνθήκη
Εσφαλμένη παράμετρος για
Δεν υπάρχουν συνθήκες
Εύρεση
Καταχώρηση
Συνθηματικό
Παρακαλώ εισάγετε το συνθηματικό και πατήστε "Εντάξει"
Εσφαλμένο συνθηματικό
Εσφαλμένο ή παλαιότερης έκδοσης αρχείο κλειδιού
Δεν είναι αρχείο κλειδιού
Προεπιλογή
Ακυρώθηκε από τον χρήστη
Γλώσσα εγχειριδίου χρήσης
Δεν βρέθηκε η διεργασία
Ανανέωση των τιμών ενός πίνακα, μόνον με εστίαση φόρμας
Μέγεθος κώδικα
Χάρτης διεργασίας
Περιθώριο διεύθυνσης
Κατάσταση
Προστασία περιθωρίου
Προστασία
Όνομα Αρθρώματος(Module)
Αυτό το πρόγραμμα λειτουργεί μόνον κάτω από λειτουργικό σύστημα Windows 2000/XP/2003/VISTA/2008/7/8/2012/10
Αποθήκευση/φόρτωση μίας διεργασίας
Λειτουργία
Εσφαλμένη Διεργασία. Η διεργασία τροποποιήθκε ή επανεκκινήθηκε
Κλείσιμο
Στο Excel
Στογγυλοποίηση επιπλεόντων τιμών
Macromedia Flash
Περιθώριο
Κράτησε την διεργασία στην μνήμη
Μέγεθος παρακρατημένης φυσικής μνήμης
Εκτέλεση μίας νέας διεργασίας
Εγκατάσταση
Δημιουργία συντόμευσης στην Επιφάνεια εργασίας
Απόκρυψη της διεργασίας
Εμφάνιση της διεργασίας
Προσομοίωση
Σύστημα παιχνιδιού
Περιθώριο διεύθυνσης
Χρήση επιλογών προσομοιωτή
Διάκενο μνήμης προσομοιωτή
Διεύθυνση προσομοιωτή
Διεύθυνση PC
Θέλετε να μετατρέψετε διευθύνσεις προσομοιωτή σε PC;
Θέλετε να μετατρέψετε διευθύνσεις PC σε προσομοιωτή;
Σφάλμα μετατροπής διεύθυνσης
Αυτόματη  ανίχνευση προσομοιωτή από όνομα αρχείου
Σύνολα
Εμφάνιση δέντρου συνόλων
Κανένα
Αριστερό
Δεξί
Νέο Σύνολο
Κεντρικό
Γλώσσα
Θέλετε να διαγράψετε αυτή την γλώσσα;
Θέλετε να προσθέσετε μία νέα γλώσσα;
Θέλετε να αλλάξετε το όνομα της γλώσσας;
κανονικό πάγωμα
μπορεί να αυξηθεί
μπορεί να ελαττωθεί
Από το ελάχιστο μέχρι το μέγιστο
Ελάχιστο
Μέγιστο
Αντιγραφή επιλεγμένων
Κατοφόρτωση του "Ανιχνευτή Κακόβουλων Διεργασιών"("Spyware Process Detector")
Το πρόγραμμα "Spyware Process Detector" δεν βρέθηκε στον υπολογιστή σας. Μπορείτε να το κατεβάσετε και να το εγκαταστήσετε από τον ιστότοπό της εταιρείας μας: www.systemsoftlab.com. Το πρόγραμμα μπορεί να λειτουργήσει μαζί με το ArtMoney ως ένας επιλογέας διεργασίας. Χρησιμοποιώντας το "Spyware Process Detector", μπορείτε να ανοίξετε οποιαδήποτε κρυφή διεργασία και οποιαδήποτε διεργασία μπλοκάρει το άνοιγμα. Το πρόγραμμα εμφανίζει λεπτομερείς πληροφορίες σχετικά με τις διεργασίες που τρέχουν στο PC σας και εντοπίζει νέα προγράμματα παρακολούθησης, trojans και ιούς(μη ανιχνεύσιμα από το πρόγραμμά σας για τον εντοπισμό ιών).
Στείλετε προτάσεις ή αναφορές σφαλμάτων σε
Επισκεφθείτε τον ιστότοπο της εταιρείας μας και κατεβάστε άλλα προγράμματα
Αυτή είναι μία δωρεάν ΠΕΡΙΟΡΙΣΜΕΝΗ έκδοση. Μπορείτε να αγοράσετε μία πλήρη έκδοση μόνον για $24.90. Είναι μία πληρωμή που γίνεται μόνο μία φορά - οι αναβαθμίσεις είναι δωρεάν!
Μόνον οι καταχωρημένοι χρήστες λαμβάνουν πλήρη τεχνική υποστήριξη και μπορούν να χρησιμοποιήσουν όλες τις επιπλέον λειτουργίες.
Για να αγοράσετε, σιγουρευτείτε οτι είστε συνδεδεμένος στο διαδίκτυο, και κάνετε κλικ στο πλήκτρο "Καταχωρήστε τώρα μέσω διαδικτύου", παρακάτω.
Καταχωρήστε τώρα μέσω διαδικτύου
Εγκατάσταση υπηρεσίας
Τα Windows χρειάζεται να πιστοποιήσουν την εγκατάσταση της υπηρεσίας.
Εγκατάσταση ως ο ακόλουθος χρήστης
Όνομα χρήστη
Τομέας
Σφάλμα εγκατάστασης υπηρεσίας. Απαγορεύεται η πρόσβαση.
Αποτυχία εισόδου για τον χρήστη
Αόρατη(Stealth) λειτουργία
Απόκρυψη της διεργασίας μου
Απόκρυψη των windows μου
Η εγκατεστημένη έκδοση της υπηρεσίας είναι παλαιά. Παρακαλώ επανεκκινήστε τον υπολογιστή σας για να εγκατασταθεί μία νέα έκδοση.
Ο πίνακας άλλαξε
Θέλετε να αποθηκεύσετε τις αλλαγές;
Ερώτηση για αποθήκευση του πίνακα εάν υπάρχουν μη αποθηκευμένες αλλαγές, πριν την έξοδο
Δομή
Παραλειφθέν
Πεδίο
Το μέγεθος της δομής δεν μπορεί να είναι μεγαλύτερο από
Αντικείμενο
Νέο αντικείμενο
Έρευνα της δομής ενός πίνακα
Έρευνα της δομής ενός συνόλου
Έρευνα της δομής των επιλεγμένων διευθύνσεων
Μετακίνηση επάνω
Μετακίνηση κάτω
Λάβετε το "ArtMoney Pro" Δωρεάν
για τον γραμματικό έλεγχο του Ρωσικού εγχειριδίου χρήσης
Τύπος στρογγυλοποίησης
Στρογγυλοποίηση στο πλησιέστερο
Στρογγυλοποίηση προς τα κάτω
Στρογγυλοποίηση προς τα επάνω
Στρογγυλοποίηση προς το μηδέν
Συνέχεια
Λάβετέ το Δωρεάν
Αποσυναρμολογητής(Disassembler)
Εντολή Assembly
Διευθυνσιοδότηση Αρθρώματος
Άρθρωμα
Διεύθυνση στο άρθρωμα
Σφάλμα μετατροπής
Δεν μπορώ να μετατρέψω την διεύθυνση του αρθρώματος: Δεν υφίσταται τέτοιο άρθρωμα στην διεργασία
Ανίχνευση περιοχής μνήμης των αρθρωμάτων συστήματος
Ανίχνευση περιοχής μνήμης των μοιρασμένων αρθρωμάτων
Άνοιγμα σφάλματος διεργασίας
Αδυναμία ανοίγματος αυτής της διεργασίας.
Προσπάθησε να χρησιμοποιήσεις την έκδοση Pro
Χρειάζεστε την έκδοση Pro γι' αυτόν τον πίνακα
Εσφαλμένος καταχωρητής
Εσφαλμένη διεύθυνση
Εσφαλμένη τιμή
Η τιμή είναι πολύ υψηλή
Εσφαλμένη εντολή assembly
Εκτελέστε μία φορά το πρόγραμμα ArtMoney ως διαχειριστής. Για να το κάνετε αυτό, κάνετε δεξί κλικ στην συντόμευση του ArtMoney και επιλέξτε το "Εκτέλεση ως -> Διαχειριστής", από το μενού.
Σφάλμα εκκίνησης της υπηρεσίας
Σφάλμα ανοίγματος της υπηρεσίας
Προσπαθήστε να επανεκκινήσετε τον υπολογιστή σας
Αλλάχθηκε από
Μετατροπή πίνακα
Θέλετε να μετατρέψετε τον πίνακά σας σε λειτουργία 64-bit;
Θέλετε να μετατρέψετε τον πίνακά σας σε λειτουργία 32-bit;
Προέκυψε σφάλμα μετατροπής. Το πρόγραμμα δεν μπορεί να μετατρέψει τις διευθύνσεις σε λειτουργία 32-bit.
Πολλαπλασιότητα της διεύθυνσης//Διαιρετότητα της διεύθυνσης
Ζυγό//Διαιρετότητα ανά 2
Μονό
Πολλαπλάσιο του 4//Διαιρετότητα ανά 4
Πολλαπλάσιο του 8//Διαιρετότητα ανά 8
Πολλαπλάσιο του 16//Διαιρετότητα ανά 16
Ανίχνευσε μόνο στατικές διευθύνσεις στα αρθρώματα
Εμφάνιση επιλογών αρθρώματος
Εισάγετε κωδικό καταχώρισης
Παρακαλώ επικολλήστε τον κωδικό καταχώρισης(χρησιμοποιείστε Ctrl-V ή το πλήκτρο "Επικόλληση") και κάνετε κλικ στο "Εντάξει"
Επικόλληση
Ο κωδικός καταχώρισης είναι εσφαλμένος
Ο κωδικός καταχώρισης είναι κατάλληλος μόνο για Αγγλική έκδοση
Ο κωδικός καταχώρισης είναι κατάλληλος μόνο για Ρωσική έκδοση
Ο κωδικός καταχώρισης είναι κατάλληλος μόνο για παλαιά έκδοση
Ο κωδικός καταχώρισης δεν λειτουργεί πλέον. Παρακαλώ επικοινωνήστε με sales@systemsoftlab.com για τον νέο σας κωδικό καταχώρισης
Εάν δεν βλέπετε το όνομά σας και τα δεδομένα σας εδώ, τότε χρησιμοποιείτε σπασμένη ή κλεμμένη έκδοση, και αυτή η έκδοση μπορεί να λειτουργεί εσφαλμένα!
Δείκτης Προς Δείκτη
Μέγιστη απόκλιση
Επίπεδο από
Ψάξε το δείκτη σε Δείκτη
Μέγιστο 2ο επίπεδο για έκδοση SE!
Προσπαθήστε να Απενεργοποιήσετε την Επιβολή της Υπογραφής Οδηγού
Γρήγορη λειτουργία (χρησιμοποιεί περισσότερη μνήμη)
Μεγαμπίτ(Mb)
Εφάρμοσε αυτόματα την απόκλιση και αντίγραψε σε νέα ομάδα
Διεύθυνση σε μπλοκ(block)
Δεν μπορώ να μετατρέψω διεύθυνση σε μπλοκ(block): Δεν υφίσταται τέτοιο μπλοκ στην διεργασία.
Πρόβλημα μετατροπής: Το μέγεθος του μπλοκ δεν είναι μοναδικό.
Ταξινόμησε τους δείκτες κατά απόκλιση
Απόκρυψε το κείμενο για πλήρως αόρατη λειτουργία//VIP μόνο
Αγοράστε ή πουλήστε Λογαριασμούς Παιχνιδιών μέσω διαδικτύου
Νέα έκδοση διαθέσιμη για κατέβασμα
Έλεγχος για νέες εκδόσεις
Δείκτης με απόκλιση
Ψάξε τον δείκτη με μέγιστη διαθέσιμη απόκλιση
διαθέσιμο από το 2ο βήμα
Φόρμουλα(Formula)
Έκδοση
Πάντοτε Στην Κορυφή
Ενεργοποίηση "Πάντοτε Στην Κορυφή"
Απενενεργοποίηση "Πάντοτε Στην Κορυφή"
Ελέγξτε την σύνδεσή σας στο διαδίκτυο! Δεν μπορεί να ανοίξει η διεύθυνση systemsoftlab.com
Προσπάθησε να ορίσεις επιλογή
Όνομα/Άρθρωμα
Δεκαεξαδικός Κωδικός
Καταχωρητής
Σημαία
Προσάρτησε Τον Διορθωτή
Αποπροσάρτησε Τον Διορθωτή
Θέλετε να προσαρτήσετε τον διορθωτή στην επιλεγμένη διεργασία;
Κατάλογος Σημείων διακοπής
Εντολές
Διορθωτής
Αποθήκευση πληροφοριών διορθωτή
Φόρτωση πληροφοριών διορθωτή
Γλώσσα Assembly
x86-32 bits
x86-64 bits
Σημείο διακοπής
Πρόσθεσε σημείο διακοπής
Αφαίρεσε σημείο διακοπής
Τρέξε
Τρέξε εώς
Εώς επιστροφή
Ιχνηλάτησε βήμα
Ιχνηλάτησε βήμα πάνω από
Ορίστε όνομα διεύθυνσης
Αφαιρέστε όνομα διεύθυνσης
Ναι
Όχι
Τύπος διορθωτή
Στάνταρ (Standard)
Διαχείριση εξαίρεσης
Τύπος εκτελέσιμου σημείου διακοπής
Λογισμική (εντολή int3)
int3
Διόρθωσε καταχωρητές (μέγ 4)
Καταχωρητής
Εξαιρέσεις σελίδας
εξαιρέσεις
Πρόσβαση σε τύπο σημείου διακοπής
Ερώτηση όταν προσαρτάται διορθωτής σε διεργασία
Χρήση λογισμικών σημείων διακοπής, όταν χρησιμοποιούνται όλοι οι καταχωρητές
Αυτόματη Αποθήκευση/Φόρτωση πληροφοριών διορθωτή
Χρησιμοποίησε σύμβολα διορθωτή
Διαδρομή συμβόλων
Ενεργό
Διάκοψε
Εκτέλεσε
Οποιαδήποτε πρόσβαση
Γράψε
Συνθήκες
Αλλαγές
Ενεργοποίησε ΌΛΑ
Απενεργοποίησε ΌΛΑ
Βρες μία εντολή που κάνει πρόσβαση στην διεύθυνση
Κατά την πρόσβαση στην μνήμη
Κατά την εγγραφή στην μνήμη
Σφάλμα συνθηκών
Σφάλμα αλλαγών
Διαίρεση με το μηδέν
Σφάλμα ανάγνωσης
Σφάλμα εγγραφής
Λάθος αριστερή πλευρά
Εκκίνηση
Σταμάτημα
Πρόσβαση
Καθάρισε αποτέλεσμα
Διαίρεσε κατά νήματα
Αριθμός
Νήμα
8-bits
16-bits
32-bits
Δεκαεξαδικός
Δεκαε.
Πλωτός(Float)4
Πλωτός(Float)8
Δεκαεξαδική ακολουθία
Ο διακομιστής systemsoflab.com δεν ανταποκρίνεται, ή δεν υπάρχει σύνδεση στο διαδίκτυο
Ο κωδικός καταχώρησης είναι απαγορευμένος
Μπορείτε να ενεργοποιήσετε αυτόν τον κωδικό μόνο 2 φορές ανά ημέρα
Ο κωδικός καταχώρησης είναι κατάλληλος μόνο για έκδοση VIP
Απόκρυψε τον διορθωτή που είναι παρών
Αποθήκευση πίνακα σε unicode μορφή
Λάβε μέγεθος μέχρι το τέλος της λειτουργίας (μέχρι επιστροφής)
Άδειες
Scan memory regions
data writable
data readonly
code writable
code readonly
shared
system
guarded
hidden
Multiplicity of each address
Address names and symbols list
Folder symbols
User names
Case sensitive
Whole words
First position
Read/Write
Auto detect size of functions
Hide debug registers
Patch this functions (structures)
Παράκαμψη προστασίας
Χρήση των ιδίων λειτουργιών για πρόσβαση στην μνήμη
User mode functions (attach to the process)
Kernel mode functions (via driver)
Attach to the process without OpenProcess
Signatures
Signature search
Add signature
Offset
Auto search
Static adress
Regions
Edit as the assembly code
As assembly code
Convert to HEX
Limit unique offsets per level
Code replacing
Replace the code
Replace all codes simultaneously
<REPLACED>
<NOT REPLACED>
<NO MODULE>
<NO BLOCK>
<NO SIGNATURE>
<NO VARIABLE>
Code injecting
Inject the code
Only after successed code replacing
Automatically replace all codes and inject
Allow to automatically replace all codes and inject
Ask for permission to automatically replace all codes and inject
The table contains a code for injection and replacement. It can be malicious code! Download tables only from most trusted websites! Do you want to inject the code in the process?
Replace all codes and inject
Cancel code replacing and injecting
Signature
Original Signature
Wrong original signature
Address of signature//full
Address of sign.//short
Address of variable/label//full
Address of variable//short
I can not convert the address of signature: No such signature.
I can not convert the address of variable: No such variable.
Name//variable or label
Code size for replacing 
One assembler instruction
Several assembler instructions
Line
Relative addressing error (offset is too big)
Invalid multiplier
Back jmp error
Cannot allocate memory
Areas//Memory areas
Set mirror address
Clear mirror address
from the minimum address
Service
Show pointer offsets in hexadecimal
Use RAX(EAX) register. Only MOV instruction with RAX(EAX) register can read/write an absolute address!
Change process speed
Your speed (%)
Normal//Speedd
Change process speed error
Increase process speed
Decrease process speed
Stack
View as stack
Save thread stack
Return adress
Parameter
Parameters
Show parameters in one line
Return address only in module
Read Memory Error
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
E8816961